{
    "id": 20050177185,
    "subjectCategory": "Electronics and Electrical Engineering",
    "abstract": "Silicon carbide (SiC) holds great potential as an electronic material because of its wide band gap energy, high breakdown electric field, thermal stability, and resistance to radiation damage. Possible aerospace applications of high-temperature, high-power, or high-radiation SiC electronic devices include sensors, control electronics, and power electronics that can operate at temperatures up to 600 C and beyond. Commercially available SiC devices now include blue light-emitting diodes (LED's) and high-voltage diodes for operation up to 350 C, with other devices under development. At present, morphological defects in epitaxially grown SiC films limit their use in device applications. Research geared toward reducing the number of structural inhomogeneities can benefit from an understanding of the type and nature of problems that cause defects. The Atomic Force Microscope (AFM) has proven to be a useful tool in characterizing defects present on the surface of SiC epitaxial films. The in-house High-Temperature Integrated Electronics and Sensors (HTIES) Program at the NASA Lewis Research Center not only extended the dopant concentration range achievable in epitaxial SiC films, but it reduced the concentration of some types of defects. Advanced structural characterization using the AFM was warranted to identify the type and structure of the remaining film defects and morphological inhomogeneities. The AFM can give quantitative information on surface topography down to molecular scales. Acquired, in part, in support of the Advanced High Temperature Engine Materials Technology Program (HITEMP), the AFM had been used previously to detect partial fiber debonding in composite material cross sections. Atomic force microscopy examination of epitaxial SiC film surfaces revealed molecular-scale details of some unwanted surface features. Growth pits propagating from defects in the substrate, and hillocks due, presumably, to existing screw dislocations in the substrates, were imaged. Away from local defects, step bunching was observed to yield step heights of hundreds of angstroms, with possible implications for the uniformity of dopants incorporated in SiC devices during fabrication. The quantitative topographic data from the AFM allow the relevant defect information to be extracted, such as the size and distribution of step bunching and the Burgers vector of screw dislocations. These atomic force microscopy results have furthered the understanding of the dynamic epitaxial SiC growth process. A model describing the observed hillock step bunching has been proposed. This cooperation between researchers involved in crystal growth, electronic device fabrication, and surface structural characterization is likely to continue as atomic force microscopy is used to improve SiC films for high-temperature electronic devices for NASA's advanced turbine engines and space power devices, as well as for future applications in the automotive industry."
}